Openfoam/now3/0/alpha.water.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{


    topWall
    {
        type            zeroGradient;
    }

    botWall
    {
        type            zeroGradient;

    }

    inlet
    {
        type            cyclic;
    }

    outlet
    {
        type            cyclic;
    }



    
    
    fixWall
    {
        type            empty;
    }

}

// ************************************************************************* //
