Openfoam/now3/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    zoneToCell
    {
        name block0;
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        
        );
    }
    zoneToCell
    {
        name block1;
        fieldValues
        (
            volScalarFieldValue alpha.water 1
           
        );
    }
);


// ************************************************************************* //